Liang_etal/oscillatingLinearMotion/0.2_NACA0012_1e-3/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh solidBodyMotionFvMesh; 

motionSolverLibs ( "libfvMotionSolvers.so" ); 

solidBodyMotionFvMeshCoeffs 
{ 
	solidBodyMotionFunction oscillatingLinearMotion; 
	oscillatingLinearMotionCoeffs 
	{ 
		amplitude (0 0.08 0); 
		omega	1.15; 
	} 
} 

// ************************************************************************* //
